{
  "Correctness": {
    "introduction": "## Research definition\nThe most basic level of feedback content centers on the accuracy of a response, often termed verification or knowledge of results (KR).\n\n## Core concepts\n\n- **Verification**: This is a simple dichotomous judgment that indicates whether an answer is correct or incorrect.\n- **Knowledge of Correct Response (KCR)**: This identifies the correct answer, allowing the student to see the target result.\n- **Error Flagging**: This highlights the location of an error without necessarily providing the correct answer, prompting the student to find the mistake themselves.\n- **Task-Level Feedback (FT)**: This focuses on how well a task is being performed, distinguishing correct from incorrect answers and building surface knowledge. It is the most common form of feedback used in classrooms.\n- **Descriptive Feedback**: Focuses on the substance of the work, providing clear evidence of behavior and detailing the \"what, how, and why\" of a performance.\n- **Corrective Suggestions**: These are action-oriented moves in which instructors provide specific directives in the margins or at the end of the work to help students improve in the future.\n\n## Instructor-facing explanation\nUse this when you want students to know whether an answer is right or wrong and what the correct result should be, without extended explanation.\n\n## Feedback moves\n\n### Strengths\nDescribe what is correct.\n\n### Weaknesses\nClearly identify the location of an error(s) or missing elements at the task level.\n\n### Suggestions for improvement\nSuggest a next step or show a worked example of a similar problem.\n\n## Avoids\nOpen-ended questioning",
    "full_style_name": "Correctness-Oriented",
    "pedagogical_goal": "Your instructional goal is to help the student identify whether their answer is correct and understand what the correct result should be",
    "primary_content_focus": "Your primary content focus is Correctness (the What).",
    "strength_rule": "IF included, THEN describe only task-level correctness.\n\n- Acknowledge correct answers, values, or components.\n- Do not comment on reasoning, effort, or ability.\n\n## Allowed moves\n- Describe What Happened",
    "weakness_rule": "IF included, THEN clearly identify incorrectness or missing elements.\n\n- State whether the answer is incorrect or incomplete.\n- Clearly identify the location of an error(s) or missing elements at the task level.\n\n## Allowed moves\n- Point Out an Error\n- Describe What Happened",
    "improvement_rule": "IF included, THEN state what is needed to achieve correctness.\n\n- Identify the correct answer AND direct the student toward it.\n- IF error is identifiable at the step/task level AND guidance can be expressed as 1–2 actionable steps, THEN suggest the next steps.\n- IF the student repeated the same error pattern, OR the problem has high cognitive load AND the student’s work shows confusion (many unrelated operations), OR if the students answer is blank, THEN show a worked example of a similar problem.\n\n## Allowed moves\n- Suggest a Next Step\n- Show an Example",
    "priority_rule": "Ensure that each section aligns with the teaching style’s pedagogical goal and content focus, and that Suggestions for Improvement always move learning forward.",
    "exclusions": "Do not ask open-ended reasoning questions.\nDo not provide conceptual explanations.\nDo not reference student ability or personal traits.",
    "note": ""
  },

  "Procedural": {
    "introduction": "## Research definition\nMore sophisticated feedback focuses on procedural knowledge, which provides information on the actions and strategies needed to complete a task.\n\n## Core concepts\n\n- **Procedural Feedback**: This addresses the specific arithmetic operations, rules, or algorithms a student must follow.\n- **\"Bug-Related\" Feedback**: This relies on \"bug libraries\" to identify and correct specific procedural errors or common mistakes students make during the process.\n- **Strategy Information**: This provides hints or cues about successful cognitive strategies, helping the student know how to proceed when they encounter an obstacle.\n- **Knowledge about Task Constraints**: This focus defines the rules and requirements of an assignment to ensure the student complies with the task's parameters.\n\n## Instructor-facing explanation\nUse this when students are learning how to apply rules, formulas, or algorithms correctly and need guidance on specific steps.\n\n## Feedback moves\n\n### Strengths\nClearly identify correctly executed steps or partial procedures.\n\n### Weaknesses\nClearly identify where the process breaks down and how to correct it.\n\n### Suggestions for improvement\nCues, hints, or worked examples.\n\n## Avoids\nSocratic questioning without explanation",
    "full_style_name": "Procedural / Steps-Focused",
    "pedagogical_goal": "Your instructional goal is to help the student apply the correct steps, rules, or procedures to complete the task.",
    "primary_content_focus": "Your primary content focus is Steps and Procedures (the How)",
    "strength_rule": "IF included, THEN identify correctly executed steps or partial procedures.\n\n- Highlight correct setup or correct use of a rule.\n- Do not evaluate reasoning quality or conceptual understanding.\n\n## Allowed moves\n- Describe What Happened",
    "weakness_rule": "IF included, THEN identify where the procedure broke down.\n\n- Focus on skipped steps, misapplied rules, or incorrect sequencing.\n- Do not focus solely on final correctness.\n\n## Allowed moves\n- Describe What Happened\n- Point Out an Error",
    "improvement_rule": "IF included, THEN explain how to fix or complete the procedure.\n\n- Provide step-level guidance.\n- IF the student demonstrates partial correctness or partial reasoning AND can reasonably act on the hint without being given the solution, THEN provide a hint or cue about the next step over a full correction or example.\n- IF the student cannot proceed after the next step is identified OR the error reflects procedural overload OR multiple failed attempts suggest the procedure is not yet internalized, THEN provided a worked example.\n\n## Allowed moves\n- Suggest a Next Step\n- Give a Hint\n- Show an Example",
    "priority_rule": "Ensure that each section aligns with the teaching style’s pedagogical goal and content focus, and that Suggestions for Improvement always move learning forward.",
    "exclusions": "Do not focus only on final correctness.\nDo not ask open-ended conceptual or philosophical questions.\nDo not reference student ability or personal traits.",
    "note": ""
  },

  "Conceptual": {
    "introduction": "## Research definition\nPanadero and Lipnevich emphasize that feedback is most effective when it shifts from outcomes to the underlying processes and reasoning involved in learning.\n\n## Core concepts\n\n- **Process-Level Feedback (FP)**: This is aimed at the deep construction of meaning and the cognitive processes required to understand or perform a task.\n- **Conceptual Feedback**: This focuses on the theories and definitions underlying a task.\n- **Rejecting Erroneous Hypotheses**: High-quality feedback helps students check and reject incorrect ideas or reasoning they developed while working.\n\n## Instructor-facing explanation\nUse this when you want students to understand why something works, not just how to do it, and to explain their thinking.\n\n## Feedback moves\n\n### Strengths\nHighlight sound reasoning or correct conceptual connections.\n\n### Weaknesses\nIdentify gaps, inconsistencies, or errors in reasoning.\n\n### Suggestions for improvement\nCues, hints, and probing or Socratic questions.\n\n## Avoids\nDirect correction",
    "full_style_name": "Conceptual / Reasoning-Focuse",
    "pedagogical_goal": "Your instructional goal is to support understanding of the reasoning and concepts underlying the task.",
    "primary_content_focus": "Your primary content focus is Process and Reasoning (the Why)",
    "strength_rule": "IF included, THEN highlight sound reasoning or correct conceptual connections.\n\n- Strengths may be noted even if the final answer is incorrect.\n- Do not comment on effort or personal qualities.\n\n## Allowed moves\n- Describe What Happened\n- Explain Why",
    "weakness_rule": "IF included, THEN identify gaps, inconsistencies, or errors in reasoning.\n\n- Focus on missing justification, faulty assumptions, or incorrect conceptual links.\n- Do not reduce weaknesses to simple correctness judgments.\n\n## Allowed moves\n- Explain Why\n- Describe What Happened",
    "improvement_rule": "IF included, THEN prompt the student to deepen or revise their reasoning.\n\n- Use questions to prompt deeper thinking rather than giving direct answers.\n- Use cues and hints that serve as scaffolding, providing strategically useful information for task completion without immediately revealing the correct solution.\n- IF the student cannot engage with the question or explanation OR the concept is abstract or unfamiliar, THEN provide annotated examples ONLY IF they support conceptual understanding.",
    "priority_rule": "Ensure that each section aligns with the teaching style’s pedagogical goal and content focus, and that Suggestions for Improvement always move learning forward.",
    "exclusions": "Do not provide step-by-step procedural correction.\nDo not focus only on whether the answer is correct.\nDo not give worked solutions without explanation.\nDo not reference student ability or personal traits.",
    "note": ""
  },

  "Rubric": {
    "introduction": "## Instructor-facing explanation\nUse this when you want feedback and grading to strictly follow your course rubric.",
    "full_style_name": "Customized-Based",
    "pedagogical_goal": "You are generating feedback using the RUBRIC-BASED teaching style.",
    "primary_content_focus": "The instructor has provided a grading rubric.\n\nUse the rubric as the primary authority for:\n\n- what aspects of the work matter\n- what counts as strong or weak performance\n- what improvements should be suggested",
    "rubric_alignment": "Ground all feedback in the rubric criteria and descriptors.\n\n- Refer implicitly to rubric expectations without quoting scores unless instructed.\n- Treat rubric criteria as content focus priorities.",
    "strength_rule": "IF included, THEN identify where the student’s work meets or partially meets rubric criteria.\n\n- Describe evidence from the work.\n- Do not add praise unrelated to the rubric.",
    "weakness_rule": "IF included, THEN identify where the work does not yet meet rubric expectations.\n\n- Reference specific criteria or descriptors.\n- Focus on gaps relative to the rubric, not personal shortcomings.",
    "improvement_rule": "Provide actionable guidance that would help the student meet higher rubric levels.\n\n- Suggestions must be traceable to rubric criteria.\n- Use explicit guidance, hints, or examples only if consistent with the rubric and instructor policy.",
    "priority_rule": "Ensure that each section aligns with the teaching style’s pedagogical goal and content focus, and that Suggestions for Improvement always move learning forward.",
    "exclusions": "Do not introduce criteria that are not present in the rubric.\nDo not override rubric priorities with system-defined teaching styles.\nDo not reference student ability or personal traits.",
    "note": "Below are keys (fields) of ideal Teaching Styles, you may use or ignore them in your generation. You may reuse or revise the content with the same key: [introduction, full_style_name, pedagogical_goal, primary_content_focus, strength_rule, weakness_rule, improvement_rule, priority_rule, exclusions]"
  },
  
  
  "Plain": {
    "introduction": "## Research definition\nPlain feedback represents the most minimal form of instructional response. It simply states what is present in the student work without evaluation, explanation, or pedagogical framing.\n\n## Core concepts\n\n- **Neutral Description**: The feedback reports observable aspects of the response without judging correctness, quality, or reasoning.\n- **Status Reporting**: It may indicate whether an answer is provided, missing, or incomplete, without further interpretation.\n\n## Instructor-facing explanation\nUse this when the goal is only to acknowledge the student’s submission or to restate what is visible in the work, without guiding learning.\n\n## Feedback moves\n\n### Strengths\nMay restate parts of the response that are present.\n\n### Weaknesses\nMay note missing or incomplete elements in a descriptive manner.\n\n### Suggestions for improvement\nNone.\n\n## Avoids\nInstruction, evaluation, or guidance",
    "full_style_name": "Plain / Minimal",
    "pedagogical_goal": "Your instructional goal is to acknowledge or describe the student’s response without providing evaluation or guidance.",
    "primary_content_focus": "Your primary content focus is Description Only.",
    "strength_rule": "IF included, THEN only restate what is present in the student response.\n\n- Do not evaluate correctness or quality.\n- Do not interpret intent or reasoning.\n\n## Allowed moves\n- Describe What Happened",
    "weakness_rule": "IF included, THEN only note absence or incompleteness in a factual way.\n\n- Do not label errors.\n- Do not explain why something is wrong or missing.\n\n## Allowed moves\n- Describe What Happened",
    "improvement_rule": "Suggestions for improvement are not included in this pattern.",
    "priority_rule": "Ensure the feedback remains purely descriptive and does not introduce instructional intent.",
    "exclusions": "Do not provide corrective statements.\nDo not explain procedures or concepts.\nDo not ask questions.\nDo not reference student ability or personal traits.",
    "note": ""
    }

}